{
  "backend/main.mo": "Main Motoko actor for the backend, defining user profiles, tests, questions, and results with CRUD operations, access control via admin/user roles, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report confirming that ProfileSetupModal.tsx was updated to use a solid dark overlay and solid white card background, removing semi-transparent styles.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing each component, page, hook, and config file's purpose and key implementation details.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme tokens (background, foreground, card, primary, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root at `#root` and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes and conditionally renders ProfileSetupModal for authenticated first-time users.",
  "frontend/src/components/admin/QuestionGallery.tsx": "Admin panel component for uploading question images with a correct-answer selector and displaying/deleting existing questions in a gallery grid.",
  "frontend/src/components/admin/ResultsTab.tsx": "Admin panel tab that fetches and displays all student test results in a table, showing student name, test name, score, and submission date.",
  "frontend/src/components/admin/TestBuilder.tsx": "Admin component for creating new tests by entering a name and duration, then selecting questions from a visual grid before submitting.",
  "frontend/src/components/admin/TestManagement.tsx": "Admin panel tab that lists all tests with their status and provides a toggle switch to publish or unpublish each test.",
  "frontend/src/components/admin/UsersTab.tsx": "Admin tab component that fetches and displays all registered users in a table with name, principal, class, and contact columns, with loading skeletons and an empty state.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that restricts access to admin-only pages, redirecting unauthenticated users to `/`, non-admins to `/dashboard`, and admins who have already visited the admin panel back to `/dashboard` with a toast.",
  "frontend/src/components/Navbar.tsx": "Sticky navy navbar with Internet Identity login/logout buttons, conditional nav links based on auth and admin status, and a responsive mobile menu toggle.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects new user profile information (name, class, contact number), validates inputs, and saves the profile via a mutation hook before navigating to the dashboard.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to the home page and shows a loading spinner while the Internet Identity auth state is initializing.",
  "frontend/src/components/TestCard.tsx": "Displays a summary card for a single test (name, duration, question count) with a button that navigates to the test-taking page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated user's profile from the backend actor, gating the query on actor readiness and authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, exposing login/logout functions and status flags via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app, covering user profiles, published tests, test submission, results, and admin operations like question and test management.",
  "frontend/src/hooks/useTestTimer.ts": "Custom hook that implements a countdown timer for a given duration in minutes, returning formatted time, remaining seconds, expiry state, and percentage remaining.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, and defines utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page component with tab-based navigation (questions, builder, management, users, results) that restricts access to admin users and marks admin visits on first mount.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the student dashboard with a welcome banner, stats bar (available tests, total questions, total duration), and a grid of test cards fetched from the backend.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing MHT-CET mock test features, benefits, and CTAs to start practicing or join Telegram/YouTube channels.",
  "frontend/src/pages/TestPage.tsx": "Interactive test-taking page that renders questions one at a time with a countdown timer, tracks answers, and submits results (auto-submitting on timeout) before navigating to the result page.",
  "frontend/src/pages/TestResultPage.tsx": "Displays the score and percentage after test submission, with a prompt to join Telegram for explanations and a button to return to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a navy color palette, custom heading/sans fonts, navy box shadows, and accordion/fadeIn animations.",
  "project_state.json": "Tracks the overall project state (version 21) for 'Concept Delta', a responsive MHT-CET test series website, including architectural notes, known issues, and a list of existing implemented features."
}