{
  "backend/main.mo": "Main Motoko actor implementing user profile management, test/question storage, and test result submission with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report specifying a rewrite of Navbar.tsx admin link visibility logic to use useGetCallerUserProfile instead of useIsCallerAdmin, deriving showAdmin from the unwrapped profile's isAdmin field.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom property tokens for light and dark themes including background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point titled 'Concept Delta' that mounts the React app at the #root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with all page routes and conditionally rendering ProfileSetupModal for first-time authenticated users.",
  "frontend/src/components/admin/QuestionGallery.tsx": "Admin panel component for uploading question images with a correct-answer selector and displaying/deleting existing questions fetched from the backend.",
  "frontend/src/components/admin/ResultsTab.tsx": "Admin tab that fetches and displays all student test results in a table, showing marks, score, percentage, and date with student and test name lookups.",
  "frontend/src/components/admin/TestBuilder.tsx": "Admin form for creating a new test by specifying name, duration, marks configuration, and selecting questions from the existing question bank.",
  "frontend/src/components/admin/TestManagement.tsx": "Admin table listing all tests with their status and a toggle switch to publish or unpublish each test via a mutation hook.",
  "frontend/src/components/admin/UsersTab.tsx": "Admin tab component that fetches and displays all registered users in a table with name, principal, class, and contact columns, with loading skeletons and an empty state.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that restricts access to admin pages, redirecting unauthenticated users to home, non-admins to dashboard, and admins who have already visited back to dashboard with a toast.",
  "frontend/src/components/Navbar.tsx": "Sticky responsive navbar with Internet Identity login/logout and an Admin link that is shown only when the user is authenticated, fully initialized, and confirmed as admin via useIsCallerAdmin.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects new user profile information (full name, class, contact number), validates inputs, and saves the profile via a mutation hook before navigating to the dashboard.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to the home page and shows a spinner while the Internet Identity auth state is initializing.",
  "frontend/src/components/TestCard.tsx": "Displays a summary card for a single test (name, duration, question count) with a button that navigates to the test-taking route.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated user's profile from the backend actor, gating the query on actor readiness and authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app, covering user profiles, published tests, test submission, results, and admin operations like questions and user management.",
  "frontend/src/hooks/useTestTimer.ts": "Custom hook that implements a countdown timer for tests, tracking remaining seconds, expiry state, formatted time string, and completion percentage.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, defines CSS custom properties for light/dark themes, and adds utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tab navigation for Question Gallery, Test Builder, Test Management, Users, and Results, gated behind an admin role check.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the student dashboard with a welcome banner, stats bar (available tests, total questions, total duration), and a grid of published test cards with loading skeletons.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page for the MHT-CET mock test platform, featuring a hero section, feature highlights, benefits list, and navigation buttons to start practicing or join Telegram/YouTube.",
  "frontend/src/pages/TestPage.tsx": "Interactive test-taking page that renders questions with answer options, tracks a countdown timer, and shows a confirmation dialog before submitting results.",
  "frontend/src/pages/TestResultPage.tsx": "Displays the result of a completed test, showing score, percentage, and a breakdown of correct, wrong, and skipped answers fetched from the user's latest result.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a custom navy color palette, Space Grotesk/Inter fonts, navy box shadows, and accordion/fadeIn animations.",
  "project_state.json": "Tracks the overall project state (version 39) for 'Concept Delta', a responsive MHT-CET test series website, including architectural notes, known issues, and a list of existing features with their IDs and requirement mappings."
}