{
  "backend/main.mo": "Main Motoko actor implementing the backend for Concept Delta, including user profile management, test/question CRUD, test result submission and retrieval, and admin operations, with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that Navbar.tsx was updated to show conditional nav links (Home, Dashboard, Admin) based on authentication and admin status, with the navy/white theme.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, and hooks.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark mode color tokens used by shadcn-ui components.",
  "frontend/index.html": "Minimal HTML shell for the Concept Delta React app, mounting the root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, dashboard, test, test result, and admin pages, and conditionally renders the ProfileSetupModal for authenticated users without a profile.",
  "frontend/src/components/admin/QuestionGallery.tsx": "Admin panel component for uploading question images with a correct-answer selector and displaying/deleting existing questions in a gallery grid.",
  "frontend/src/components/admin/ResultsTab.tsx": "Admin tab that fetches and displays all student test results in a table, showing student name, test name, score, and submission date.",
  "frontend/src/components/admin/TestBuilder.tsx": "Admin form for creating a new test by entering a name and duration, then selecting questions from a visual grid of uploaded question images.",
  "frontend/src/components/admin/TestManagement.tsx": "Admin table listing all tests with their duration, question count, publish status, and a toggle switch to publish or unpublish each test.",
  "frontend/src/components/admin/UsersTab.tsx": "Admin tab component that fetches and displays all registered users in a table with columns for name, principal, class, and contact number, with loading skeletons and an empty state.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that restricts access to admin pages, redirecting unauthenticated users to home, non-admins to dashboard, and admins who have already visited the admin panel back to dashboard with a toast notification.",
  "frontend/src/components/Navbar.tsx": "Sticky responsive navbar with the Concept Delta brand on the left and conditional nav links (Home, Dashboard, and Admin for admins only) plus a Login/Logout button on the right, styled in navy blue and white for both desktop and mobile menus.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's full name, class, and contact number, validates the inputs, and saves the profile via a mutation hook before navigating to the dashboard.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to the home page and shows a spinner while the Internet Identity auth state is initializing.",
  "frontend/src/components/TestCard.tsx": "Displays a summary card for a single test (name, duration, question count) with a button that navigates to the test-taking route.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the currently authenticated caller's user profile from the backend actor using React Query, accounting for actor loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend interactions including user profiles, published tests, test results, questions, and admin operations.",
  "frontend/src/hooks/useTestTimer.ts": "Custom hook that implements a countdown timer for tests, tracking remaining seconds, expiry state, formatted time string, and completion percentage.",
  "frontend/src/index.css": "Global stylesheet importing Inter and Space Grotesk fonts, defining Tailwind CSS layers with CSS custom properties for light/dark themes, and utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tab navigation for Question Gallery, Test Builder, Test Management, Users, and Results, gated behind an admin privilege check.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the student dashboard with a welcome banner, stats bar (available tests, total questions, total duration), and a responsive grid of test cards fetched from the backend.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing MHT-CET mock test features, benefits, and CTAs to start practicing or join Telegram/YouTube channels.",
  "frontend/src/pages/TestPage.tsx": "Interactive test-taking page with a countdown timer, per-question navigation, answer selection, and auto/manual submission that redirects to the result page.",
  "frontend/src/pages/TestResultPage.tsx": "Displays the test result (score, percentage) after submission and prompts the user to join Telegram for explanations or return to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a navy color palette, custom fonts (Inter, Space Grotesk), navy box shadows, and accordion/fade-in animations.",
  "project_state.json": "Tracks the project state (version 13) for 'Concept Delta', a responsive MHT-CET test series website, including architectural notes, existing features, and requirements for Home, Dashboard, Test, and Admin pages with Google/Internet Identity auth and a Navy Blue/White theme."
}