{
  "backend/main.mo": "Main actor for the ICP backend implementing user profile management, test/question CRUD, and test result submission with role-based access control (admin/user) and blob storage mixins.",
  "backend/migration.mo": "State migration module defining OldActor and NewActor types (identical) and a no-op `run` function that passes state through unchanged.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — Internet Identity-only login and first-time profile setup modal — to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component, hook, and page's purpose and styling conventions.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark mode color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point titled 'Concept Delta' that mounts the React app at `#root` via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React app with TanStack Router defining all routes and a RootLayout that shows a loading spinner, Navbar, ProfileSetupModal for first-time authenticated users, and a Toaster.",
  "frontend/src/components/admin/QuestionGallery.tsx": "Admin panel tab for uploading image-based questions with a correct-answer selector and displaying/deleting existing questions.",
  "frontend/src/components/admin/ResultsTab.tsx": "Admin panel tab that fetches and displays all student test results in a table with student name, test name, score, and date.",
  "frontend/src/components/admin/TestBuilder.tsx": "Admin panel tab for creating a new test by entering a name, duration, and selecting questions from a visual image grid.",
  "frontend/src/components/admin/TestManagement.tsx": "Admin component that lists all tests in a table and allows toggling their published/draft status via a switch control.",
  "frontend/src/components/admin/UsersTab.tsx": "Admin component that fetches and displays all registered users in a table showing name, principal, class, and contact number.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to `/`, non-admins to `/dashboard`, and admins who have already visited the admin panel to `/dashboard` with a toast notification.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with Internet Identity login/logout, active route highlighting, admin-only link, and a mobile hamburger menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects and saves a new user's full name, class, and contact number before redirecting to the dashboard.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to the home page and shows a spinner while the identity is initializing.",
  "frontend/src/components/TestCard.tsx": "Card component displaying a test's name, duration, and question count with a button to navigate to the test-taking page.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing admin access control when a token is present.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Hook that fetches the currently authenticated user's profile from the backend actor, gating the query on actor readiness and authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, persisting identity across page reloads via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for all backend interactions including user profiles, tests, questions, results, and admin operations.",
  "frontend/src/hooks/useTestTimer.ts": "Hook that implements a countdown timer for tests, tracking remaining seconds, expiry state, formatted time string, and completion percentage.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind CSS theme variables for light/dark modes along with custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with tab navigation for Question Gallery, Test Builder, Test Management, Users, and Results. Restricts access to admin users and marks admin visits on first mount.",
  "frontend/src/pages/DashboardPage.tsx": "Student dashboard displaying a welcome banner, stats (available tests, total questions, total duration), and a grid of published test cards.",
  "frontend/src/pages/HomePage.tsx": "Public landing page showcasing MHT-CET mock test features, benefits, and CTAs to start practicing or join Telegram/YouTube channels.",
  "frontend/src/pages/TestPage.tsx": "Test-taking page that renders questions one at a time with a countdown timer, tracks answers, and submits results (manually or automatically on timeout).",
  "frontend/src/pages/TestResultPage.tsx": "Post-test result page showing the user's score and percentage, a Telegram CTA for explanations, and a button to return to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Concept Delta frontend, extending the default theme with custom navy blue colors, fonts (Inter, Space Grotesk), shadows, border radii, and animations including accordion and fadeIn keyframes.",
  "project_state.json": "Project state tracking file (version 19) describing the Concept Delta MHT-CET test series website, including architectural notes, known issues, and a list of existing implemented features across frontend and backend."
}