{
  "backend/main.mo": "Main Motoko actor defining user profiles, tests, questions, and test results with role-based access control and blob storage mixins; exposes CRUD endpoints for users and admins including admin-visit tracking.",
  "backend/migration.mo": "Migration module that upgrades the stored actor state by adding a `hasVisitedAdmin: false` field to all existing user profiles.",
  "feature_evidence.json": "Feature evidence report documenting the admin panel first-visit access flow feature, listing affected files, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom property tokens for light and dark mode color themes including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point titled 'Concept Delta' that mounts the React app via a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with routes for home, dashboard, test, test result, and admin pages, and conditionally renders the ProfileSetupModal for new users.",
  "frontend/src/components/admin/QuestionGallery.tsx": "Admin panel component for uploading question images with a correct-answer selector and displaying/deleting existing questions in a gallery grid.",
  "frontend/src/components/admin/ResultsTab.tsx": "Admin tab that fetches and displays all student test results in a table, showing student name, test name, score with percentage, and submission date.",
  "frontend/src/components/admin/TestBuilder.tsx": "Admin form for creating a new test by entering a name, duration, and selecting questions from a thumbnail grid, then submitting via a mutation hook.",
  "frontend/src/components/admin/TestManagement.tsx": "Admin table listing all tests with their duration, question count, and publish status, allowing admins to toggle each test's published state via a switch.",
  "frontend/src/components/admin/UsersTab.tsx": "Admin tab component that fetches and displays all registered users in a table with columns for name, principal, class, and contact number, with loading skeletons and an empty state.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that restricts the admin page to authenticated admins on their first visit, redirecting repeat visitors to the dashboard with an informational toast.",
  "frontend/src/components/Navbar.tsx": "Sticky responsive navbar with the Concept Delta logo, conditional nav links based on auth/admin status, and an Internet Identity login/logout button with mobile menu support.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's full name, class, and contact number, validates the inputs, and saves the profile via a mutation hook before navigating to the dashboard.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to the home page and shows a spinner while the Internet Identity auth state is initializing.",
  "frontend/src/components/TestCard.tsx": "Displays a summary card for a single test showing its name, duration, and question count, with a button that navigates to the test-taking page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated caller's user profile from the backend actor using React Query, accounting for actor loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app, covering user profiles, published tests, test retrieval, result submission, and admin operations like managing questions, tests, and users.",
  "frontend/src/hooks/useTestTimer.ts": "Custom hook that implements a countdown timer for tests, tracking remaining seconds, expiry state, formatted time string, and completion percentage, with an optional expiry callback.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, and defines utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tab navigation for Question Gallery, Test Builder, Test Management, Users, and Results, gated behind an admin check that redirects unauthorized users.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the student dashboard with a welcome banner, stats bar (available tests, total questions, total duration), and a grid of test cards fetched from the backend.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing MHT-CET mock test features, benefits, and CTAs to start practicing or join Telegram/YouTube channels.",
  "frontend/src/pages/TestPage.tsx": "Interactive test-taking page that renders questions one at a time with a countdown timer, tracks answers, and submits results (auto-submitting on timeout) before navigating to the result page.",
  "frontend/src/pages/TestResultPage.tsx": "Displays the score and percentage after test submission, with a prompt to join Telegram for explanations and a button to return to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a navy color palette, custom fonts (Inter, Space Grotesk), navy box shadows, and accordion/fade-in animations.",
  "project_state.json": "Tracks the project state (version 11) for 'Concept Delta', a responsive MHT-CET test series website, including architectural notes, existing features, and requirements for Home, Dashboard, Test, and Admin pages with Google/Internet Identity auth and a Navy Blue/White theme."
}