{
  "kind": "build_request",
  "title": "Update Navbar to show Home, Dashboard, and Admin (admin-only) nav links",
  "projectName": "Concept Delta",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Update Navbar.tsx so that when a user is authenticated, the navbar displays navigation links for 'Home', 'Dashboard', and — visible only to users with isAdmin = true — 'Admin'. The 'Admin' link must be hidden from non-admin authenticated users and from unauthenticated visitors. All links must follow the existing Navy Blue (#0A1F44) and White theme: white text on the navy background, with a hover/active highlight consistent with the current navbar style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "show home, dashboard and admin for admin only button in navbar"
        ]
      },
      "acceptanceCriteria": [
        "When a non-authenticated user visits any page, the navbar shows no navigation links (Home, Dashboard, Admin).",
        "When an authenticated non-admin user is logged in, the navbar shows 'Home' and 'Dashboard' links only; the 'Admin' link is not rendered.",
        "When an authenticated admin user (isAdmin = true) is logged in, the navbar shows 'Home', 'Dashboard', and 'Admin' links.",
        "'Home' navigates to '/', 'Dashboard' navigates to '/dashboard', and 'Admin' navigates to '/admin'.",
        "All nav links use white text on the #0A1F44 navbar background, consistent with the existing Navy Blue/White theme.",
        "The mobile hamburger menu also respects the same visibility rules for each nav link.",
        "No other navbar behaviour (logo, login/logout button, sticky positioning) is changed."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All styling must remain within the Navy Blue (#0A1F44) and White theme — do not introduce new accent colours."
  ],
  "nonGoals": [
    "Changing the admin route guard logic in AdminRoute.tsx or ProtectedRoute.tsx.",
    "Changing the backend isAdmin logic.",
    "Adding new pages or routes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}