{
  "kind": "build_request",
  "title": "Fix Admin link not visible in Navbar for admin users",
  "projectName": "Concept Delta",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Completely rewrite the Admin link visibility logic in Navbar.tsx. Remove all existing useIsCallerAdmin, useGetCallerRole, or any route-gated admin check hooks. Replace with a single unconditional call to useGetCallerUserProfile that is enabled whenever the user is authenticated (isAuthenticated === true), with no route condition or path guard whatsoever. Unwrap the Option returned by the backend (Motoko Option maps to a JS array — read index [0] to get the profile object, then read profile.isAdmin). Derive showAdmin = unwrappedProfile?.isAdmin === true. Render the 'Admin' navigation link in both the desktop nav and the mobile hamburger menu as soon as showAdmin is true, on every route including '/'. Never hide or reset the Admin link based on the current route. The Admin link must remain hidden for unauthenticated users and authenticated non-admin users. Maintain the existing Navy Blue (#0A1F44) and White theme styling throughout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "admin button not visible in the navbar"
        ]
      },
      "acceptanceCriteria": [
        "An authenticated user with isAdmin = true sees the 'Admin' navigation link in the desktop navbar on the Home page ('/' route)",
        "An authenticated user with isAdmin = true sees the 'Admin' navigation link in the desktop navbar on the Dashboard page ('/dashboard' route)",
        "An authenticated user with isAdmin = true sees the 'Admin' link in the mobile hamburger menu on all routes including '/'",
        "The Admin link does not appear for unauthenticated users on any route",
        "The Admin link does not appear for authenticated users where isAdmin is false or undefined",
        "The useGetCallerUserProfile query runs unconditionally on every route whenever isAuthenticated is true — it is not gated behind a route check",
        "The profile Option returned by the backend is correctly unwrapped (array index [0]) before reading isAdmin",
        "showAdmin is never reset or overridden based on the current route path",
        "All existing navbar styling (Navy Blue #0A1F44 background, white text, hover highlight) is preserved"
      ]
    }
  ],
  "constraints": [
    "Do not modify any file listed in frontend.immutablePaths",
    "Do not introduce any route-specific condition that gates the profile query or the Admin link on the current URL path",
    "The fix must not affect the visibility rules for non-admin users — Admin link must remain hidden from them"
  ],
  "nonGoals": [
    "Changes to backend admin logic or data models",
    "Changes to AdminRoute.tsx or ProtectedRoute.tsx guard logic",
    "Changes to any other navbar styling or layout beyond the Admin link visibility fix"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}