{
  "kind": "build_request",
  "title": "Replace Google Login with Internet Identity authentication (platform-native auth)",
  "projectName": "Concept Delta",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "The platform does not support Google Login. The authentication system must use Internet Identity (already implemented via useInternetIdentity.ts and the existing InternetIdentityProvider). Remove any references to Google Login from the codebase — including the Home Page navbar login button, any Google OAuth configuration, and any UI copy mentioning Google. Replace all such references with the existing Internet Identity login flow (login/logout via useInternetIdentity hook).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Google Login authentication"
        ]
      },
      "acceptanceCriteria": [
        "No Google Login button or OAuth flow exists anywhere in the app",
        "The navbar Login button triggers Internet Identity authentication",
        "All UI copy referring to Google Login is removed or replaced with 'Login with Internet Identity'"
      ]
    },
    {
      "id": "REQ-24",
      "text": "After a user authenticates via Internet Identity for the first time (i.e., their profile does not yet exist in the backend), display the existing ProfileSetupModal collecting: Full Name (text, required), Class (dropdown: 11th / 12th / Dropper, required), and Contact Number (numeric, required). On submission, call the backend registerUser/saveProfile function to persist the profile data, then redirect the user to /dashboard. This flow already exists in ProfileSetupModal.tsx — verify it is correctly wired to the Internet Identity auth state and that the backend call succeeds. Fix any broken integration.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "After login ask: Full Name, Class (11th/12th/Dropper), Contact Number",
          "Save user data in database"
        ]
      },
      "acceptanceCriteria": [
        "After first Internet Identity login, the profile setup modal is shown automatically",
        "The modal collects Full Name, Class (11th/12th/Dropper), and Contact Number",
        "Submitting the form calls the backend and persists the user profile",
        "After successful profile save, the user is redirected to /dashboard",
        "Returning users (profile already exists) are not shown the modal again"
      ]
    }
  ],
  "constraints": [
    "Do NOT implement Google OAuth or any third-party authentication. Only Internet Identity is supported on this platform.",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts.",
    "Do not modify files under frontend/src/components/ui.",
    "Do not modify frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Adding any new authentication providers beyond Internet Identity",
    "Changing the profile fields beyond Full Name, Class, and Contact Number",
    "Modifying the backend data model for user profiles (already implemented)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}