{
  "kind": "build_request",
  "title": "Fix transparent submit confirmation dialog background on Test Page",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "In TestPage.tsx, fix the 'Submit Test?' confirmation dialog/modal so that its overlay uses a solid dark background (e.g. rgba(0,0,0,0.85) or bg-gray-900) and the dialog card itself uses a solid white background (#FFFFFF) with navy (#0A1F44) text. The dialog currently renders with a transparent or semi-transparent background, causing the underlying question content to show through and making the confirmation text ('Submit Test?', 'You have answered X out of Y questions...'), the 'Submit Now' button, and the 'Continue Test' button unreadable. Remove all transparent or translucent background styles from the confirmation dialog overlay and card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "see screenshot clearly after sumbiting test message see like this transparent so please this message background create dark white solid"
        ]
      },
      "acceptanceCriteria": [
        "The submit confirmation dialog overlay has a solid dark background (rgba(0,0,0,0.85) or equivalent) — no underlying page content is visible through the overlay.",
        "The dialog card has a solid white (#FFFFFF) background — no transparency or translucency.",
        "All text in the dialog ('Submit Test?', unanswered question warning) is clearly readable in navy (#0A1F44) on the white card.",
        "The 'Submit Now' button is clearly visible with solid navy (#0A1F44) background and white text.",
        "The 'Continue Test' button is clearly visible with appropriate solid styling.",
        "The fix applies on both mobile and desktop viewports."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths.",
    "All styling must remain consistent with the existing Navy Blue (#0A1F44) and White theme."
  ],
  "nonGoals": [
    "Changing the submit confirmation logic or flow.",
    "Redesigning the test page layout beyond the dialog background fix.",
    "Modifying the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}