{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Navbar to show Home, Dashboard, and Admin (admin-only) nav links",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Update Navbar.tsx to display 'Home', 'Dashboard', and 'Admin' (admin-only) navigation links for authenticated users, respecting the Navy Blue (#0A1F44) and White theme",
      "acceptanceCriteria": [
        "When a non-authenticated user visits any page, the navbar shows no navigation links (Home, Dashboard, Admin).",
        "When an authenticated non-admin user is logged in, the navbar shows 'Home' and 'Dashboard' links only; the 'Admin' link is not rendered.",
        "When an authenticated admin user (isAdmin = true) is logged in, the navbar shows 'Home', 'Dashboard', and 'Admin' links.",
        "'Home' navigates to '/', 'Dashboard' navigates to '/dashboard', and 'Admin' navigates to '/admin'.",
        "All nav links use white text on the #0A1F44 navbar background, consistent with the existing Navy Blue/White theme.",
        "The mobile hamburger menu also respects the same visibility rules for each nav link.",
        "No other navbar behaviour (logo, login/logout button, sticky positioning) is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Add conditional navigation links for 'Home', 'Dashboard', and 'Admin'. The 'Home' link navigates to '/', 'Dashboard' to '/dashboard', and 'Admin' to '/admin'. All links must only appear when the user is authenticated. The 'Admin' link must be conditionally rendered based on the user's admin status (isAdmin = true) fetched from the backend. Use the authorization component's isCallerAdmin backend method or derive admin status from the user profile context. Ensure both desktop and mobile menu (hamburger menu) implement the same visibility rules. Style all links with white text on the #0A1F44 navy background, with hover states consistent with the existing navbar style. Do not modify the logo, login/logout button, or sticky positioning."
        }
      ]
    }
  ]
}